Repository: petrachuk/AVP.AuthCore
Catalog: AVP.AuthCore.Application/Resources/ErrorMessages.*.resx
Languages: ru

# error.registration_failed
source: User registration failed
ru: Ошибка регистрации пользователя

# error.invalid_access_token
source: Access token is invalid or has expired
ru: Недействительный или просроченный токен доступа

# error.invalid_credentials
source: Invalid username or password
ru: Неверное имя пользователя или пароль

# error.refresh_token_expired
source: Refresh token has expired
ru: Срок действия токена обновления истек

# error.refresh_token_not_found
source: Refresh token not found
ru: Токен обновления не найден

# error.refresh_token_already_revoked
source: Refresh token has already been revoked
ru: Токен обновления уже отозван

# error.refresh_token_invalid
source: Invalid refresh token
ru: Недействительный токен обновления

# error.session_expired
source: User session has expired
ru: Сессия пользователя истекла

# error.concurrent_login
source: Concurrent login detected
ru: Обнаружен одновременный вход

# error.user_not_found
source: User not found
ru: Пользователь не найден

# error.user_already_exists
source: User already exists
ru: Пользователь уже существует

# error.user_locked
source: User account is locked
ru: Учетная запись заблокирована

# error.user_disabled
source: User account has been disabled
ru: Учетная запись отключена

# error.email_not_confirmed
source: Email address has not been confirmed
ru: Email адрес не подтвержден

# error.email_already_confirmed
source: Email address has already been confirmed
ru: Email адрес уже подтвержден

# error.invalid_email_confirmation_token
source: Email confirmation token is invalid or has expired
ru: Недействительный или просроченный токен подтверждения email

# error.invalid_password_reset_token
source: Password reset token is invalid or has expired
ru: Недействительный или просроченный токен сброса пароля

# error.invalid_email
source: Invalid email format
ru: Неверный формат email

# error.invalid_username
source: Invalid username format
ru: Неверный формат имени пользователя

# error.password_requires_digit
source: Password must contain at least one digit
ru: Пароль должен содержать хотя бы одну цифру ('0'-'9')

# error.password_requires_non_alphanumeric
source: Password must contain at least one special character
ru: Пароль должен содержать хотя бы один специальный символ

# error.password_requires_upper
source: Password must contain at least one uppercase letter
ru: Пароль должен содержать хотя бы одну заглавную букву ('A'-'Z')

# error.password_requires_lower
source: Password must contain at least one lowercase letter
ru: Пароль должен содержать хотя бы одну строчную букву

# error.password_contains_personal_data
source: Password cannot contain personal information
ru: Пароль не может содержать персональные данные

# error.role_not_found
source: Role not found
ru: Роль не найдена

# error.user_already_in_role
source: User is already in this role
ru: Пользователь уже имеет данную роль

# error.user_not_in_role
source: User is not in this role
ru: Пользователь не имеет данной роли

# error.default_role_not_found
source: Default role not found
ru: Роль по умолчанию не найдена

# error.external_authentication_error
source: External authentication error occurred
ru: Ошибка внешней аутентификации

# error.external_provider_not_found
source: External authentication provider not found
ru: Провайдер внешней аутентификации не найден

# error.external_user_already_associated
source: External user is already associated with an account
ru: Внешний пользователь уже связан с учетной записью

# error.validation_failed
source: Validation failed
ru: Ошибка валидации

# error.invalid_request
source: Invalid request
ru: Неверный запрос

# error.invalid_operation
source: Invalid operation
ru: Недопустимая операция

# error.database_error
source: Database operation failed
ru: Ошибка работы с базой данных

# error.communication_error
source: Communication error occurred
ru: Ошибка связи

# error.configuration_error
source: Configuration error occurred
ru: Ошибка конфигурации

# error.too_many_requests
source: Too many requests
ru: Слишком много запросов

# error.too_many_failed_attempts
source: Too many failed attempts
ru: Слишком много неудачных попыток

# error.two_factor_required
source: Two-factor authentication is required
ru: Требуется двухфакторная аутентификация

# error.invalid_two_factor_code
source: Invalid two-factor authentication code
ru: Неверный код двухфакторной аутентификации

# error.two_factor_already_enabled
source: Two-factor authentication is already enabled
ru: Двухфакторная аутентификация уже включена

# error.two_factor_not_enabled
source: Two-factor authentication is not enabled
ru: Двухфакторная аутентификация не включена

# error.invalid_recovery_code
source: Invalid recovery code
ru: Неверный код восстановления
